; domain
;; domain_3.pddl for bimanual manipulation
;; This domain is for the passing goal exclusively

(define (domain domain_3)
  (:requirements :strips)

  (:types graspable - object
          hand - object
          experimenterHand - hand
          location - object
  )

  (:predicates 
  	(at ?hand - hand ?obj - graspable)
    (approached ?hand - hand ?obj - graspable)
    (enclosed ?hand - hand ?obj - graspable)
    (passed ?obj - graspable ?objLoc - location ?expHand - hand ?expHandLoc - location)
  )

  (:action approach
           :parameters (?hand - hand ?obj - graspable)
           :precondition (and (not (at ?hand ?obj)))
           :effect (and (at ?hand ?obj))
   )

   (:action enclose
           :parameters (?hand - hand ?obj - graspable)
           :precondition (and (at ?hand ?obj) (not (enclosed ?hand ?obj)))
           :effect (and (enclosed ?hand ?obj))
   )

   (:action pass
           :parameters (?hand1 ?hand2 - hand ?obj - graspable ?objLoc - location ?expHand - experimenterHand ?expHandLoc - location)
           :precondition (and (enclosed ?hand1 ?obj) (enclosed ?hand2 ?obj) (not (= ?hand1 ?hand2)) (not (= ?hand1 ?expHand)) (not (= ?hand2 ?expHand)) (not (at ?expHand ?obj)) (not (at ?expHand ?objLoc)))
           :effect (and (passed ?obj ?objLoc ?expHand ?expHandLoc))
   )
)

; problem
;; problem file: task_Exp4_pass.pddl
;; This problem file is to run Fast Downward for the "pass" task. It is for Experiment 4.
(define (problem bimanual-probPass)
  (:domain domain_3)
(:objects banana bowl extra_large_clamp master_chef_can mustard_bottle power_drill tomato_soup_can wood_block initial_location_handleft initial_location_handright initial_location_experimenter_hand - graspable 
            handright handleft - hand
            experimenter_hand - experimenterHand
            1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 - location 
  )
    (:init 
  	(at handleft initial_location_handleft)
    (at handright initial_location_handright)
    (at experimenter_hand initial_location_experimenter_hand)
  )
(:goal (and (passed wood_block 15 experimenter_hand 7))))

; plan
1. (approach handright wood_block)
   added: (at handright wood_block)
   goals met: 0 of 1
2. (enclose handright wood_block)
   added: (enclosed handright wood_block)
   goals met: 0 of 1
3. (approach handleft wood_block)
   added: (at handleft wood_block)
   goals met: 0 of 1
4. (enclose handleft wood_block)
   added: (enclosed handleft wood_block)
   goals met: 0 of 1
5. (pass handleft handright wood_block 15 experimenter_hand 7)
   added: (passed wood_block 15 experimenter_hand 7)
   goals met: 1 of 1
